FilesystemAndDisk_Test/FS_Disk_SSD_980_NVMe_scripts/980_fs_fio_test_read_ranseq/rand_read_block_512k_4_2_jobs.out
rand_read_test: (g=0): rw=randread, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=4
...
fio-3.28
Starting 2 processes

rand_read_test: (groupid=0, jobs=2): err= 0: pid=3141500: Sat May 18 14:26:48 2024
  read: IOPS=1678, BW=839MiB/s (880MB/s)(200GiB/244054msec)
    slat (usec): min=18, max=790, avg=76.39, stdev=16.80
    clat (usec): min=1351, max=11743, avg=4685.01, stdev=441.90
     lat (usec): min=1418, max=12231, avg=4761.76, stdev=440.24
    clat percentiles (usec):
     |  1.00th=[ 3687],  5.00th=[ 3982], 10.00th=[ 4146], 20.00th=[ 4359],
     | 30.00th=[ 4490], 40.00th=[ 4555], 50.00th=[ 4686], 60.00th=[ 4752],
     | 70.00th=[ 4883], 80.00th=[ 5014], 90.00th=[ 5211], 95.00th=[ 5407],
     | 99.00th=[ 5866], 99.50th=[ 6063], 99.90th=[ 6456], 99.95th=[ 6587],
     | 99.99th=[ 6980]
   bw (  KiB/s): min=843957, max=872448, per=100.00%, avg=860185.10, stdev=1686.24, samples=974
   iops        : min= 1648, max= 1704, avg=1679.68, stdev= 3.27, samples=974
  lat (msec)   : 2=0.01%, 4=5.33%, 10=94.66%, 20=0.01%
  cpu          : usr=0.93%, sys=8.90%, ctx=397159, majf=0, minf=1091
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=409600,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=839MiB/s (880MB/s), 839MiB/s-839MiB/s (880MB/s-880MB/s), io=200GiB (215GB), run=244054-244054msec

Disk stats (read/write):
  nvme2n1: ios=409296/0, merge=0/0, ticks=1908816/0, in_queue=1908815, util=100.00%

Test Time: 2024-05-18 14:26:49
Device Name: filetest.txt
Device Info: